Courses/4420/Lectures/Refreshers/chroot.org

# -*- mode: org -*-
#+date: 2018-12-05
#+TITLE: SysCall =chroot=
#+AUTHOR: Prabhaker Mateti
#+HTML_LINK_HOME: ../../Top/index.html
#+HTML_LINK_UP: ../
#+HTML_HEAD: <style> P,li {text-align: justify} code {color: brown;} @media screen {BODY {margin: 10%} }</style>
#+BIND: org-html-preamble-format (("en" "<a href=\"../../\"> ../../</a> | <a href=./>NoSlides</a>"))
#+BIND: org-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2018 <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a> &bull; %d"))
#+STARTUP:showeverything
#+OPTIONS: toc:0


* Background

1. Prerequisite: Libcalls v syscalls.

1. Read through =man syscalls= and =man chroot= + =man 2 chroot=

* Usage/ Semantics of =chroot=

1. The word root here is about the root of a directory hierarchy, not
   the super-user.

1. Before entering the chroot a number of directories need to be
   mounted.  Some basic configuration files will need to be copied
   from the host.

: # mount -t proc /proc /mnt/mychroot/proc
: # mount --rbind /dev /mnt/mychroot/dev
: # mount --rbind /sys /mnt/mychroot/sys
: # mount --rbind /tmp /mnt/mychroot/tmp
: # cp /etc/resolv.conf /mnt/mychroot/etc

Then, invoke =# chroot /mnt/mychroot /bin/bash=

** Full Path Names

1. Full path names begin with the =/= (the slash).
1. Consider the file/dir hierarchy preferably with multiple mounts.
1. =chroot= can re-locate the root directory of a full path name to any
   directory on this hierarchy.
1. Consider a process with PID 12345.  Examine =/proc/12345/root= This
   will be a symbolic link to the "root" dir of this process.

** Goal: Chroot Jail

1. Having chroot-ed, =/../= becomes illegal.  This brought us the term
   "chroot jail".  "First Gen Sandbox"

** Man Pages?!

1. Man pages do their best, but are not always unambiguous or
   definitive.

1. =man chroot= has the following at the top: "chroot - run command or
   interactive shell with special root directory".

   1. This is way too ambiguous.

** Root Only?

1. The chroot system call is only available to the root user. A
   non-root user cannot execute a chroot() call.

1. Any process having done a =chroot= ought to drop its privileges to
   run as =nobody= or an otherwise unknown user.

1. Computer System Security, Lecture 4,
   https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-858-computer-systems-security-fall-2014/lecture-notes/MIT6_858F14_lec4.pdf
   8pp
1. "On Safes, Sandboxes, and Spies", CS 161 : Computer Security, Lecture 5,
   https://inst.eecs.berkeley.edu/~cs161/fa16/slides/lec5.pdf 33
   slides, 2016.

* References

1. https://en.wikipedia.org/wiki/Chroot Required Reading
1. https://lwn.net/Articles/252794/ 2007 What chroot() is really for. Required Reading
1. https://wiki.gentoo.org/wiki/Chroot Required Reading

* End
# Local variables:
# after-save-hook: org-html-export-to-html
# end:
