Courses/4420/Lectures/Refreshers/chroot.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-08 Sun 23:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SysCall <code>chroot</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a> | <a href=./>NoSlides</a>
</div>
<div id="content">
<h1 class="title">SysCall <code>chroot</code></h1>


<div id="outline-container-org0676942" class="outline-2">
<h2 id="org0676942"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Prerequisite: Libcalls v syscalls.</li>

<li>Read through <code>man syscalls</code> and <code>man chroot</code> + <code>man 2 chroot</code></li>
</ol>
</div>
</div>

<div id="outline-container-orgab587f2" class="outline-2">
<h2 id="orgab587f2"><span class="section-number-2">2</span> Usage/ Semantics of <code>chroot</code></h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>The word root here is about the root of a directory hierarchy, not
the super-user.</li>

<li>Before entering the chroot a number of directories need to be
mounted.  Some basic configuration files will need to be copied
from the host.</li>
</ol>

<pre class="example">
# mount -t proc /proc /mnt/mychroot/proc
# mount --rbind /dev /mnt/mychroot/dev
# mount --rbind /sys /mnt/mychroot/sys
# mount --rbind /tmp /mnt/mychroot/tmp
# cp /etc/resolv.conf /mnt/mychroot/etc

</pre>

<p>
Then, invoke <code># chroot /mnt/mychroot /bin/bash</code>
</p>
</div>

<div id="outline-container-orgbe3111f" class="outline-3">
<h3 id="orgbe3111f"><span class="section-number-3">2.1</span> Full Path Names</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Full path names begin with the <code>/</code> (the slash).</li>
<li>Consider the file/dir hierarchy preferably with multiple mounts.</li>
<li><code>chroot</code> can re-locate the root directory of a full path name to any
directory on this hierarchy.</li>
<li>Consider a process with PID 12345.  Examine <code>/proc/12345/root</code> This
will be a symbolic link to the "root" dir of this process.</li>
</ol>
</div>
</div>

<div id="outline-container-org4f2e29b" class="outline-3">
<h3 id="org4f2e29b"><span class="section-number-3">2.2</span> Goal: Chroot Jail</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Having chroot-ed, <code>/../</code> becomes illegal.  This brought us the term
"chroot jail".  "First Gen Sandbox"</li>
</ol>
</div>
</div>

<div id="outline-container-org9adbc02" class="outline-3">
<h3 id="org9adbc02"><span class="section-number-3">2.3</span> Man Pages?!</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Man pages do their best, but are not always unambiguous or
definitive.</li>

<li><code>man chroot</code> has the following at the top: "chroot - run command or
interactive shell with special root directory".

<ol class="org-ol">
<li>This is way too ambiguous.</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-org83e2286" class="outline-3">
<h3 id="org83e2286"><span class="section-number-3">2.4</span> Root Only?</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>The chroot system call is only available to the root user. A
non-root user cannot execute a chroot() call.</li>

<li>Any process having done a <code>chroot</code> ought to drop its privileges to
run as <code>nobody</code> or an otherwise unknown user.</li>

<li>Computer System Security, Lecture 4,
<a href="https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-858-computer-systems-security-fall-2014/lecture-notes/MIT6_858F14_lec4.pdf">https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-858-computer-systems-security-fall-2014/lecture-notes/MIT6_858F14_lec4.pdf</a>
8pp</li>
<li>"On Safes, Sandboxes, and Spies", CS 161 : Computer Security, Lecture 5,
<a href="https://inst.eecs.berkeley.edu/~cs161/fa16/slides/lec5.pdf">https://inst.eecs.berkeley.edu/~cs161/fa16/slides/lec5.pdf</a> 33
slides, 2016.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org38d96c8" class="outline-2">
<h2 id="org38d96c8"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://en.wikipedia.org/wiki/Chroot">https://en.wikipedia.org/wiki/Chroot</a> Required Reading</li>
<li><a href="https://lwn.net/Articles/252794/">https://lwn.net/Articles/252794/</a> 2007 What chroot() is really for. Required Reading</li>
<li><a href="https://wiki.gentoo.org/wiki/Chroot">https://wiki.gentoo.org/wiki/Chroot</a> Required Reading</li>
</ol>
</div>
</div>

<div id="outline-container-orgaf72c54" class="outline-2">
<h2 id="orgaf72c54"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-12-05
</div>
</body>
</html>
